# 变量作用域：变量在函数内部定义，则变量作用域为函数内部，变量在函数外部定义，则变量作用域为函数外部
# 模块级变量在本模块内可见；别的模块要通过 import 才能用
# 局部变量在函数内部可见；函数内部不能访问函数外部的变量
# 什么是模块？模块是包含 Python 代码的文件，文件名就是模块名。模块可以包含变量、函数、类等。
# 什么是包？包是包含多个模块的目录，目录名就是包名。包可以包含模块、子包、文件等。

# python 的变量作用域规则：
# 1. 局部变量：在函数内部定义的变量，只能在函数内部使用
# 2. 全局变量：在函数外部定义的变量，可以在函数内部使用
# 3. 模块级变量：在模块文件中定义的变量，可以在模块文件内部使用
# 4. 全局变量：在模块文件中定义的变量，可以在模块文件内部使用

a = 10

if a > 5:
    b = 20
    print(b)

print(b)

def test():
    c = 10
    print(b)

test()
# print(c) # NameError: name 'c' is not defined